<a href="https://colab.research.google.com/github/hlsvalle/curso_data_science/blob/master/Estudo_Pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
#Criando um dataFrame através de um dicionario
dados_dict = {
  "nome" : ["Hugo", "Aline", "Bianca", "Bielzinho"],
  "idade": [37,31,10,7],
  "cidade": ["Campo Grande", "Corumbá", "Fatima do Sul", "Bonito"],
  'comprou': [True, False, True, False] 
}

In [3]:
df = pd.DataFrame(dados_dict)

In [4]:
df

        nome  idade         cidade  comprou
0       Hugo     37   Campo Grande     True
1      Aline     31        Corumbá    False
2     Bianca     10  Fatima do Sul     True
3  Bielzinho      7         Bonito    False

In [5]:
#Mudando o index do DataFrame
df.index = [145,146,147,148]

In [6]:
df

          nome  idade         cidade  comprou
145       Hugo     37   Campo Grande     True
146      Aline     31        Corumbá    False
147     Bianca     10  Fatima do Sul     True
148  Bielzinho      7         Bonito    False

In [9]:
#Acessando determinado dado através do index
df.loc[146]

nome         Aline
idade           31
cidade     Corumbá
comprou      False
Name: 146, dtype: object

In [10]:
#Trazendo todas as idades do dataFrame
df['idade']

145    37
146    31
147    10
148     7
Name: idade, dtype: int64

In [16]:
#Trazendo a média de idades
df_idade = df['idade']

In [17]:
df_idade.mean()

21.25

In [18]:
#Segunda forma de trazer a média
df.idade.mean()

21.25

In [21]:
#Alterando o nome das colunas do datraFrame
df.columns = ['NOME', 'IDADE', 'CIDADE', 'COMPROU']

In [22]:
df

          NOME  IDADE         CIDADE  COMPROU
145       Hugo     37   Campo Grande     True
146      Aline     31        Corumbá    False
147     Bianca     10  Fatima do Sul     True
148  Bielzinho      7         Bonito    False

In [23]:
#Criando uma coluna no DataFrame
df['saldo'] = [100, 250, 300 , 400]

In [24]:
df

          NOME  IDADE         CIDADE  COMPROU  saldo
145       Hugo     37   Campo Grande     True    100
146      Aline     31        Corumbá    False    250
147     Bianca     10  Fatima do Sul     True    300
148  Bielzinho      7         Bonito    False    400

In [25]:
#Criando um dataFrame a partir de uma lista
lista = [["Joao", 60, "Corumba", True, 600],
         ["Leo", 60, "Fatima do Sul", True, 800]]

In [26]:
df_lista = pd.DataFrame(lista)

In [27]:
df_lista

      0   1              2     3    4
0  Joao  60        Corumba  True  600
1   Leo  60  Fatima do Sul  True  800

In [28]:
df_lista.columns = ["NOME", "IDADE", "CIDADE", "COMPROU", "SALDO"]

In [29]:
df_lista

   NOME  IDADE         CIDADE  COMPROU  SALDO
0  Joao     60        Corumba     True    600
1   Leo     60  Fatima do Sul     True    800

In [30]:
df_lista.index = [123, 456]

In [31]:
df_lista

     NOME  IDADE         CIDADE  COMPROU  SALDO
123  Joao     60        Corumba     True    600
456   Leo     60  Fatima do Sul     True    800

In [32]:
df_lista.loc[456]

NOME                 Leo
IDADE                 60
CIDADE     Fatima do Sul
COMPROU             True
SALDO                800
Name: 456, dtype: object